ETL/DataProcessors/РассылкаУведомленийОСобытияхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>РассылкаУведомленийОСобытияхБаз</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТолькоОшибочные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиРассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ETL/InformationRegisters/СтатистикаЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/InformationRegisters/ПолучателиРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПолучателиРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>АдресОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Enums/ТипыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УведомленияОЗаявках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомленияАдминистраторам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ETL/DataProcessors/РассылкаУведомленийОСобытияхБаз/Ext/ObjectModule.bsl
Функция ПолучитьДанныеСтатистикиЗагрузкиЗаПериод(знач ДатаНачала, знач ДатаОкончания, знач База = Неопределено) Экспорт
	
	ДатаНачала = НачалоДня(?(ЗначениеЗаполнено(ДатаНачала), ДатаНачала, Дата("19000101")));
	ДатаОкончания = КонецДня(?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, Дата("29991231")));
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Базы.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТБазы
	                      |ИЗ
	                      |	Справочник.Базы КАК Базы
	                      |ГДЕ
	                      |	НЕ Базы.ПометкаУдаления
	                      |	И НЕ Базы.Отключена
	                      |	И ВЫБОР
	                      |			КОГДА НЕ &База В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Базы.ПустаяСсылка))
	                      |				ТОГДА Базы.Ссылка = &База
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СтатистикаЗагрузки.ДатаЗапроса КАК ДатаЗапроса,
	                      |	СтатистикаЗагрузки.ЕстьОшибки КАК ЕстьОшибки,
	                      |	СтатистикаЗагрузки.ДатаОбработки КАК ДатаОбработки,
	                      |	СтатистикаЗагрузки.Обработан КАК Обработан,
	                      |	СтатистикаЗагрузки.База КАК База
	                      |ПОМЕСТИТЬ втСтатистикаЗагрузки
	                      |ИЗ
	                      |	РегистрСведений.СтатистикаЗагрузки КАК СтатистикаЗагрузки
	                      |ГДЕ
	                      |	СтатистикаЗагрузки.ДатаОбработки МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.ДатаЗапроса, &ПустаяДата)) КАК ДатаПоследнейВыгрузки,
	                      |	МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.ЕстьОшибки, ЛОЖЬ)) КАК ЕстьОшибки,
	                      |	МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.ДатаОбработки, &ПустаяДата)) КАК ДатаУспешнойЗагрузки,
	                      |	МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.Обработан, ЛОЖЬ)) КАК Обработан,
	                      |	ВТБазы.Ссылка КАК База
	                      |ИЗ
	                      |	ВТБазы КАК ВТБазы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втСтатистикаЗагрузки КАК втСтатистикаЗагрузки
	                      |		ПО ВТБазы.Ссылка = втСтатистикаЗагрузки.База
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТБазы.Ссылка
	                      |
	                      |ИМЕЮЩИЕ
	                      |	НЕ &ТолькоОшибочные
	                      |		ИЛИ МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.ДатаОбработки, &ПустаяДата)) = &пустаяДата
	                      |		ИЛИ (МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.ЕстьОшибки, ЛОЖЬ)) И НЕ МАКСИМУМ(ЕСТЬNULL(втСтатистикаЗагрузки.Обработан, ЛОЖЬ)))");
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	Запрос.УстановитьПараметр("База", 			База); 
	Запрос.УстановитьПараметр("ПустаяДата", 	Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТолькоОшибочные", ТолькоОшибочные);    
	
	Возврат Новый Структура("Данные", Запрос.Выполнить().Выгрузить()); 
	
КонецФункции

Процедура ПрочитатьСписокПолучателейРассылки() Экспорт 

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПолучателиРассылки.АдресОтправки КАК EMail
	                      |ИЗ
	                      |	РегистрСведений.ПолучателиРассылки КАК ПолучателиРассылки
	                      |ГДЕ
	                      |	ПолучателиРассылки.ТипУведомления = &ТипУведомления
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПолучателиРассылки.АдресОтправки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПолучателиРассылки.АдресОтправки
	                      |АВТОУПОРЯДОЧИВАНИЕ"); 
	Запрос.УстановитьПараметр("ТипУведомления", Перечисления.ТипыУведомлений.УведомленияАдминистраторам);
	ПолучателиРассылки.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ДатаИнициализации = ТекущаяДата() - 60*60*24; 
	
	ДатаНачала = НачалоДня(ДатаИнициализации);
	ДатаОкончания = КонецДня(ДатаИнициализации);
	
	ПрочитатьСписокПолучателейРассылки();
	ТолькоОшибочные = Истина;
	
	Обработки.РассылкаУведомленийОСобытияхБаз.ВыполнитьРассылкуРезультатовКонтроля(ПолучитьДанныеСтатистикиЗагрузкиЗаПериод(ДатаНачала, ДатаОкончания).Данные.Скопировать(), ПолучателиРассылки)
	
КонецПроцедуры
